{"format":"layers-model","generatedBy":"keras v3.10.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.10.0","backend":"tensorflow","model_config":{"class_name":"Functional","config":{"name":"vmae_bilstm","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"vmae_feat","batchInputShape":[null,8,768]},"name":"vmae_feat","inbound_nodes":[]},{"class_name":"LayerNormalization","config":{"name":"layer_normalization","trainable":true,"dtype":"float32","axis":[-1],"epsilon":0.001,"center":true,"scale":true,"rms_scaling":false,"beta_initializer":{"class_name":"zeros","config":{}},"gamma_initializer":{"class_name":"ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"name":"layer_normalization","inbound_nodes":[[["vmae_feat",0,0]]]},{"class_name":"TimeDistributed","config":{"name":"proj","trainable":true,"dtype":"float32","layer":{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"glorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"zeros","config":{}},"kernel_regularizer":{"class_name":"l2","config":{"l2":0.001}},"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}},"name":"proj","inbound_nodes":[[["layer_normalization",0,0]]]},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.4,"seed":null,"noise_shape":null},"name":"dropout","inbound_nodes":[[["proj",0,0]]]},{"class_name":"Bidirectional","config":{"name":"bilstm","trainable":true,"dtype":"float32","merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"forward_lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"glorotUniform","config":{"seed":null}},"recurrent_initializer":{"class_name":"orthogonal","config":{"seed":null,"gain":1.0}},"bias_initializer":{"class_name":"zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"l2","config":{"l2":0.001}},"recurrent_regularizer":{"class_name":"l2","config":{"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.4,"recurrent_dropout":0.0,"seed":null}},"backward_layer":{"class_name":"LSTM","config":{"name":"backward_lstm","trainable":true,"dtype":"float32","return_sequences":true,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"zero_output_for_mask":true,"units":128,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"glorotUniform","config":{"seed":null}},"recurrent_initializer":{"class_name":"orthogonal","config":{"seed":null,"gain":1.0}},"bias_initializer":{"class_name":"zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":{"class_name":"l2","config":{"l2":0.001}},"recurrent_regularizer":{"class_name":"l2","config":{"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.4,"recurrent_dropout":0.0,"seed":null}}},"name":"bilstm","inbound_nodes":[[["dropout",0,0]]]},{"class_name":"TemporalAttention","config":{"name":"attention","units":64,"trainable":true,"dtype":"float32"},"name":"attention","inbound_nodes":[[["bilstm",0,0]]]},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"glorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"zeros","config":{}},"kernel_regularizer":{"class_name":"l2","config":{"l2":0.001}},"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_3","inbound_nodes":[[["attention",0,0]]]},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.5,"seed":null,"noise_shape":null},"name":"dropout_1","inbound_nodes":[[["dense_3",0,0]]]},{"class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":"float32","units":13,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"glorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_4","inbound_nodes":[[["dropout_1",0,0]]]}],"input_layers":[["vmae_feat",0,0]],"output_layers":[["dense_4",0,0]]}},"training_config":{"loss":{"class_name":"CategoricalCrossentropy","config":{"name":"categorical_crossentropy","reduction":"sum_over_batch_size","from_logits":false,"label_smoothing":0.0,"axis":-1}},"loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":4.999999873689376e-05,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"attention/dense_16/kernel","shape":[256,64],"dtype":"float32"},{"name":"attention/dense_16/bias","shape":[64],"dtype":"float32"},{"name":"attention/dense_17/kernel","shape":[64,1],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/kernel","shape":[256,512],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"forward_lstm/lstm_cell/bias","shape":[512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/kernel","shape":[256,512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"backward_lstm/lstm_cell/bias","shape":[512],"dtype":"float32"},{"name":"dense_3/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_3/bias","shape":[128],"dtype":"float32"},{"name":"dense_4/kernel","shape":[128,13],"dtype":"float32"},{"name":"dense_4/bias","shape":[13],"dtype":"float32"},{"name":"layer_normalization/gamma","shape":[768],"dtype":"float32"},{"name":"layer_normalization/beta","shape":[768],"dtype":"float32"},{"name":"dense/kernel","shape":[768,256],"dtype":"float32"},{"name":"dense/bias","shape":[256],"dtype":"float32"}]}]}
